app/controllers/products_controller.rb

SELECT `products`.* FROM `products` ORDER BY created_at, DESC LIMIT 20
---
  def index
    @products = Product.order("created_at DESC").limit(20)

SELECT `products`.* FROM `products` WHERE `products`.`id` = 352 LIMIT 1
---
  def show
    @product = Product.find(params[:id])

SELECT `products`.* FROM `products` WHERE (title like '%params[:keyword]%')
---
  def search
    @products =Product.where("title like '%#{params[:keyword]}%'")