app/controllers/reviews_controller.rb

  def new
    @product = Product.find(params[:product_id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 0 LIMIT 1

  def create
    Review.create(review_params)
---
INSERT INTO `reviews` (`created_at`, `nickname`, `product_id`, `rate`, `review`, `updated_at`) VALUES ('2016-06-01 11:20:20', 'as', 354, 1, 'as', '2016-06-01 11:20:20')