app/views/products/index.html.erb

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 355
SELECT AVG(`reviews`.`rate`) AS avg_id FROM `reviews` WHERE `reviews`.`product_id` = 355
---
                    <p class="text-small">
                    <%if product.reviews.present? %>
                      <span class="rating-star">
                        <i class="star-actived rate-<%=product.reviews.average(:rate).round%>0"></i>